#Напишете програма, която да пресмята колко евро може да купи спрямо следните валутни курсове:
#• 1 биткойн = 1168 лева • 1 китайски юан = 0.15 долара • 1 долар = 1.76 лева • 1 евро = 1.95 лева
#Обменното бюро има комисионна от 0% до 5% от крайната сума в евро.
#Входни данни
#От конзолата се четат 3 числа:
#• На първия ред – броят биткойни. Цяло число в интервала [0 … 20].
#• На втория ред – броят китайски юани. Реално число в интервала [0.00 … 50 000.00].
#• На третия ред – комисионната. Реално число в интервала [0.00 … 5.00].
#Изходни данни
#На конзолата да се отпечата 1 число - резултатът от обмяната на валутите.
#Резултатът да се форматира до втората цифра след десетичния знак.

bitcoins = int(input())
yuans = float(input())
commision = float(input())
bbitcoins = bitcoins * 1168 / 1.95
byuans = yuans * 0.15 * 1.76 / 1.95
euros = (bbitcoins + byuans) - (commision / 100 * (bbitcoins + byuans))
print(f"{euros:.2f}")


